<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"ef82f036163b87f42ee577a2c81d3cf21796a96fa81b1fcbed2a36d0c86e8d6f","plan_job_ref":"Job Pull Request Checks #4484 at https://github.com/GSA-TTS/FAC/actions/runs/13920928246","plan_out_hash":"5cc2e76abb14d2209ca7677b323420428d4965966671974f412a04c9749dbbc6","plan_hash":"ee5fe115e09d4a379ef404b15785031088f4b6a0c3a535998bd3bf8cff8a9cf4","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 4 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "ce880589-cfed-0c08-7225-d78834d31d26"

-       policy {
-           destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857" -> null
        }
-       policy {
-           destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "e4cb13f2-3e3f-4b19-a1d2-076ebfd1fd7a" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "e4cb13f2-3e3f-4b19-a1d2-076ebfd1fd7a"
        }
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "b03ca21f-c8ff-335b-7ef7-89dd796c8e14"

-       policy {
-           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
        }
-       policy {
-           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
        }
+       policy {
+           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b74a991de6029f90524ce976f90286263f4e5709fd4fb40f8c1f7055c2478ba4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:62bc1afee9a5c8f9f4cfcb475b117306cefb63053666080949f9c7d955345116"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-14T14:54:19Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*****************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-03-14T17:11:25Z" -> (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b74a991de6029f90524ce976f90286263f4e5709fd4fb40f8c1f7055c2478ba4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:62bc1afee9a5c8f9f4cfcb475b117306cefb63053666080949f9c7d955345116"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-14T14:54:20Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4484](https://github.com/GSA-TTS/FAC/actions/runs/13920928246)